01_Dummy_cases/01_Dynamic_mesh/nccImpeller/Allrun_pre
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory


blockMesh -blockTopology > log.blockMeshTopology
blockMesh > log.blockMesh

#------------------------------------------------------------------------------
